b = int(input("Введите значение первого элемента прогрессии")) 
q = int(input("Введите значение множителя прогрессии"))
n = int(input("Введите номер последнего элемента прогрессии")) #Пишем ввод трёх переменных с клавы
if b >= -10000 and b <= 10000: #проверяем условия для переменной b
    if q > 1 and q <= 50: #проверяем условия для переменной q
        if n >= 2 and n <= 100: #проверяем условия для переменной n
            print (b*(q**n-1 / (q-1))) #выводим результат по формуле суммы геометрической проегрессии
        else:  print ("Ошибка в переменной")#прикрепляем элз если переменная n неправильная
    elif q == 1: #учитываем, что при q = 1, формула будет другая
        if n >= 2 or n <= 100:#не забываем про правильную логику номера
            print (n*b) #выводим результат по формуле частного случая    
        else:  print ("Ошибка в переменной")   
    else:  print ("Ошибка в переменной")#прикрепляем элз если переменная q неправильная
else:  print ("Ошибка в переменной")#прикрепляем элз если переменная b неправильная