n = int(input("Введите число"))#делаем ввод с клавы
operations = (n + 2) // 3#сразу считаем число операций, чтобы потом вывести, если число будет непростым, т.к. формула работает для непростых чисел
if n >= 1 and n <= 100000:#вешаем ограничения на n, которые были в условии задачи
    for i in range(2, n):#как и впрошлом файле ставим такой рендж для проверки числа на простое или непростое, промежуток менбше 1 не учитываем, т.к. по условию задачи n ограничено от 1 до 100000
        if n % i == 0:#проверяем остаток от деления на другие числа и если он равень нулю, то есть другие делители, а значит число непростое
            print (f"Число операций = {operations}")#если число непростое, то выводим результат нашей формулы
            break#останавливаем прогу, т.к. если есть результат операций, значит случай если число простое не понадобится
        else:#ну а если число всё таки простое, то прописываем для него элз
            print ("Ошибка переменной")#выводим ошибку переменной в случае ведённого простого числа
            break#останавливаем прогу после вывода ошикби
        