n = int(input("Введите число"))#пишем ввод с клавы
if n >= 1 and n <=25:
    if n <= 1:#начинается проверка на непростое число, все числа меньше либо равно 1 - простые
        print("Не простое число")#выводим, что число непростое в такое случае
    for i in range(2, n):#после первых строк вводим рендж от 2 до n, т.к. с остальными числами мы разобрались до
        if n % i == 0:#проверяем остаток от деления на другие числа, и если такой делитель найдётся, то такое число сразу непростое по определению
            print("Не простое число (делится на", i, ")") #выводим если нашли какой то делитель
            break#прописываем брейк, т.к. в случае чего прога должна остановиться, а не идти дальше
    else:#прописывем элз если после проверок число оказалось простым
        print("Простое число!")#выводим простое число
else:#вводим элз если введено число которое не подходит по условию задачи
    print("Ошибка переменной")#выводим в этом случае ошибку переменной